package com.crm.controller.turnedOff;

public class ClientPageController {
    //добавить функцию отображения всех заявок ОДНОГО пользователя
    public void usersOrderList(){
        //отобразить заявки

        //отобразить файлы для скачки
        //отобразить услуги по названию
        //отобразить статус по названию
        //отобразить программы по названию
        //отобразить ответственного по имени
    }
    //добавить функцию отображения ответственного по заявке
    public void showUser(){
        //отобразить данные пользователя
    }
    //добавление, удаление и редактирование заявки
    public void addOrder(){
        //Добавление нового заказа (класс order)
        //Добавление нового файла (Клиент сервера)
        //Выбор услуги по названию
        //выбор статуса по названию
        //выбор программы по названию
        //выбор ответственного по имени
        //занести новые данные в промежуточную таблицу услуг
        //занести новые данные в промежуточную таблицу программ
    }
    public void deleteOrder(){
        //удалить заявку
        //удалить файлы
        //удалить услугу назначенную на данную заявку
        //удалить статус удаляемой услуги
        //удалить программы по названию
        //удалить ответственного удаляемой услуги
        //удалить данные в промежуточной таблице услуг
        //удалить данные в промежуточной таблице программ
    }
    public void editOrder(){
        //редактировать заявку
        //редактировать файлы
        //редактировать услугу назначенную на данную заявку
        //редактировать статус удаляемой услуги
        //удалить программы по названию
        //редактировать ответственного удаляемой услуги
        //редактировать данные в промежуточной таблице услуг
        //редактировать данные в промежуточной таблице программ
    }
}
